---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayModel.SmoothEdges
source: html/0ef7548a-cf1f-7ec0-e2bd-a7e4ecc7e253.htm
---
# Autodesk.Revit.DB.ViewDisplayModel.SmoothEdges Property

True to enable "smooth edge" (anti-aliasing) effect. False to disable it.

## Syntax (C#)
```csharp
public bool SmoothEdges { get; set; }
```